app/controllers/searches_controller.rb

SELECT `searches`.* FROM `searches`
---
  def index
    redirect_to new_search_url
=begin @searches = Search.all

SELECT `searches`.* FROM `searches` WHERE `searches`.`id` = 1 LIMIT 1
---
  def show
    redirect_to new_search_url
=begin    @search = Search.find(params[:id])